; - Encyclopedia Entry -

[MZPatchwork X2EncyclopediaTemplate]
ListTitle = "Patchwork Class"
DescriptionTitle = "Patchwork Class"
DescriptionEntry = "Tech specialists best known for their chaining electrical attacks, a Patchwork brings a broad array of tools to the squad." 


;***************************************
;GTS Unlocks Descriptions
;***************************************
; - GTS Unlocks -

[MZPatchworkUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "Patchwork: Voltaic Inspiration I"
Summary = "All Patchwork soldiers' Ionic Capacitors proficiency will now start at level 2, regardless of rank."

[MZPatchworkUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "Patchwork: Voltaic Inspiration II"
Summary = "All Patchwork soldiers' Ionic Capacitors proficiency will now start at level 3, regardless of rank.<br/><br/><font color='#CA7200'>Requires Voltaic Inspiration I</font>"

;***************************************
;New Ability Descriptions
;***************************************

[WOTC_APA_PatchworkCore X2AbilityTemplate]
LocFriendlyName = "Ionic Capacitors"
LocHelpText = "Experimental GREMLIN tech allows for potent chaining electrical attacks and protective shielding."
LocLongDescription = "Experimental GREMLIN tech allows for potent chaining electrical attacks and protective shielding."
LocPromotionPopupText="<font color='#CA7200'>LEVEL I</font> (gained at <Ability:RANKNAME1/> rank [1])<br/><Bullet/> Gain Chaining Jolt - The <Ability:ClassName/> sends the GREMLIN to an enemy to jolt them. Attack chains to nearby enemies. Damage is increased against robotic enemies. <br/><Bullet/> Gain Combat Scanner - The GREMLIN scans the designated area, revealing and applying Holo Targeting to all enemies. <br/><Bullet/> Gain <font color='#3ABD23'>+2</font> Shield HP. <br/><br/><font color='#CA7200'>LEVEL II</font> (gained at <Ability:RANKNAME3/> rank [3])<br/><Bullet/> Gain Target Definition - Any unit seen by the <Ability:ClassName/> remains permanently visible. <br/><Bullet/> Gain Barrier Charger - Recharge 1 shield at the start of each turn. <br/><Bullet/> Gain <font color='#3ABD23'>+2</font> Shield HP. <br/><br/><font color='#CA7200'>LEVEL III</font> (gained at <Ability:RANKNAME6/> rank [6])<br/><Bullet/> Gain Voltaic Arc - The GREMLIN shocks enemies if they move too close to the <Ability:ClassName/> or if the <Ability:ClassName/> moves close to them. This attack chains to nearby enemies. <br/><Bullet/> Gain <font color='#3ABD23'>+2</font> Shield HP."

[TargetDefinition X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by the <Ability:ClassName/> remains permanently visible."
LocHelpText="Any unit seen by the <Ability:ClassName/> remains permanently visible."
LocPromotionPopupText="<Bullet/> Scouting with the <Ability:ClassName/> will allow enemies to be tracked even if they enter the fog of war.<br/>"
